---
kind: property
id: P:Autodesk.Revit.DB.Visual.BumpMap.TextureRealWorldScaleX
source: html/fb16978c-8211-7b64-33d9-faff78715a5f.htm
---
# Autodesk.Revit.DB.Visual.BumpMap.TextureRealWorldScaleX Property

The property labeled "Size X" from the "BumpMap" schema.

## Syntax (C#)
```csharp
public static string TextureRealWorldScaleX { get; }
```

## Remarks
This property is of type "AssetPropertyDistance" with a minimum of "0.01".